
//Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
//Визначити кількість його парних дільників
//Знайти суму його парних дільників

let number = +prompt("Введите натуральное число", 0);
let score = 0;

if (!isNaN(number)) {
    for (let i = 0; i < number; i++) {
        if (i % 2 == 0) {
            if (number % i == 0) {
                document.write(`Число ${i} - парный дилитель числа ${number}</p>`);
                score++;
            }
        }
    }
    alert(`У числа ${number} имеется ${score} парных дилителей.`);
}

