
//Вивести на сторінку в один рядок через кому числа від 10 до 20

//Знайти добуток усіх цілих чисел від 15 до 35
//sum += Math.pow(i, 2); - ви додаєте просто кожне з чисел у другій степені - це не вірно
//Знайти середнє арифметичне всіх цілих чисел від 1 до 500
//у вас в умові циклу, не враховується значення 500, останнє значення що додається 499, тому результат не є вірним
//І останнє, завдання,
//Дано натуральне число. Знайти та вивести на сторінку всі його дільники. - у вас умова одразу тільки на парні
//Визначити кількість його парних дільників - то ок
//Знайти суму його парних дільників - сума не прорахована


let result = "";

for (var i = 10; i < 20; i++) {
    result += `${i}, `;
}

result += `${i}.`;

document.write(result);